# file      Assembly Utility
# date      2009/01/07
# author    kkamagui 
#           Copyright(c)2008 All rights reserved by kkamagui
# brief     О©╫О©╫О©╫О©╫О©╫О©╫О©? О©╫О©╫ф©О©╫О©╫ф╪ О©╫т╪О©╫О©╫О©╫ О©╫О©╫О©╫ц╣О©╫ О©╫р╫О©╫ О©╫О©╫О©╫О©╫

[BITS 64]           ; О©╫О©╫О©╫О©╫О©╫О©╫ О©╫з╣О©╫О©? 64О©╫О©╫ф╝ О©╫з╣О©╫О©? О©╫О©╫О©╫О©╫

SECTION .text       ; text О©╫О©╫О©╫О©╫(О©╫О©╫О©╫в╦О©╫ф╝)О©╫О©╫ О©╫О©╫О©╫О©╫

; C О©╫О©╫Н©║О©╫О©? хёО©╫О©╫О©╫О©╫ О©╫О©╫ О©╫ж╣О©╫О©╫О©╫ О©╫л╦О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫(Export)

global kInPortByte, kOutPortByte, kLoadGDTR, kLoadTR, kLoadIDTR
global kEnableInterrupt, kDisableInterrupt, kReadRFLAGS, getFaultAddress
global kReadTSC
global kSwitchContext
global kSwitchContext, kHlt, kTestAndSet
; О©╫О©╫ф╝О©╫н╨О©╫О©╫О©╫ 1О©╫О©╫О©╫О©╫ф╝О©╫О©╫ О©╫О©╫О©╫О©╫
;   PARAM: О©╫О©╫ф╝ О©╫О©╫хё
kInPortByte:
    push rdx        ; О©╫т╪О©╫О©╫О©╫О©╫О©╫ О©╫с╫ц╥О©╫ О©╫О©╫О©╫О©╫о╢О©? О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ О©╫О©╫О©╫ц©О©╫ О©╫О©╫О©╫О©╫
                    ; О©╫т╪О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫ О©╫н╨п©О©╫О©╫О©╫ О©╫О©╫О©╫ц©О©╫ О©╫О©╫О©╫т╣О©╫ О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫

    mov rdx, rdi    ; RDX О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫д╤О©╫О©╫О©╫О©? 1(О©╫О©╫ф╝ О©╫О©╫хё)О©╫О©╫ О©╫О©╫О©╫О©╫
    mov rax, 0      ; RAX О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ О©╫й╠О©╫х╜
    in al, dx       ; DX О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫О©╫О©╫О©╫О©? О©╫О©╫ф╝ О©╫О©╫Е╥╧О©╫О©╫О©╫О©╫О©╫О©? О©╫О©╫ О©╫О©╫О©╫О©╫ф╝О©╫О©╫ О©╫п╬О©╫
                    ; AL О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫О©╫О©╫О©╫, AL О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╢О©╫ О©╫т╪О©╫О©╫О©╫ О©╫О©╫х╞ О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫

    pop rdx         ; О©╫т╪О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©? О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ О©╫О©╫О©╫О©╫
    ret             ; О©╫т╪О©╫О©╫О©╫ хёО©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫ О©╫з╣О©╫О©╫О©╫ О©╫О©╫д║О©╫О©╫ О©╫О©╫О©╫О©╫

; О©╫О©╫ф╝О©╫О©╫ 1О©╫О©╫О©╫О©╫ф╝О©╫О©╫ О©╫О©╫
;   PARAM: О©╫О©╫ф╝ О©╫О©╫хё, О©╫О©╫О©╫О©╫О©╫О©╫
kOutPortByte:
    push rdx        ; О©╫т╪О©╫О©╫О©╫О©╫О©╫ О©╫с╫ц╥О©╫ О©╫О©╫О©╫О©╫о╢О©? О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ О©╫О©╫О©╫ц©О©╫ О©╫О©╫О©╫О©╫
    push rax        ; О©╫т╪О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫ О©╫н╨п©О©╫О©╫О©╫ О©╫О©╫О©╫ц©О©╫ О©╫О©╫О©╫т╣О©╫ О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
    
    mov rdx, rdi    ; RDX О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫д╤О©╫О©╫О©╫О©? 1(О©╫О©╫ф╝ О©╫О©╫хё)О©╫О©╫ О©╫О©╫О©╫О©╫
    mov rax, rsi    ; RAX О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫д╤О©╫О©╫О©╫О©? 2(О©╫О©╫О©╫О©╫О©╫О©╫)О©╫О©╫ О©╫О©╫О©╫О©╫
    out dx, al      ; DX О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫О©╫О©╫О©╫О©? О©╫О©╫ф╝ О©╫О©╫Е╥╧О©╫О©╫О©╫О©? AL О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫О©╫О©╫О©╫О©?
                    ; О©╫О©╫ О©╫О©╫О©╫О©╫ф╝О©╫О©╫ О©╫О©╫

    pop rax         ; О©╫т╪О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©? О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ О©╫О©╫О©╫О©╫
    pop rdx
    ret             ; О©╫т╪О©╫О©╫О©╫ хёО©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫ О©╫з╣О©╫О©╫О©╫ О©╫О©╫д║О©╫О©╫ О©╫О©╫О©╫О©╫

; GDTR О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ GDT О©╫О©╫О©╫л╨О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
;   PARAM: GDT О©╫О©╫О©╫л╨О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫о╢О©╫ О©╫з╥А╠╦О©╫О©╫О©╫О©╫ О©╫О©╫Е╥╧О©╫О©?
kLoadGDTR:
    lgdt [ rdi ]    ; О©╫д╤О©╫О©╫О©╫О©? 1(GDTRО©╫О©╫ О©╫О©╫Е╥╧О©╫О©?)О©╫О©╫ О©╫О©╫О©╫н╪О©╫О©╫О©╫О©╫О©╫ О©╫н╣О©╫О©╫о©О©╫
                    ; GDT О©╫О©╫О©╫л╨О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
    ret

; TR О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ TSS О©╫О©╫О©╫в╦О©╫ф╝ О©╫О©╫е╘О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
;   PARAM: TSS О©╫О©╫О©╫в╦О©╫ф╝ О©╫О©╫е╘О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫
kLoadTR:
    ltr di          ; О©╫д╤О©╫О©╫О©╫О©? 1(TSS О©╫О©╫О©╫в╦О©╫ф╝ О©╫О©╫е╘О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫)О©╫О©╫ О©╫О©╫О©╫н╪О©╫О©╫О©╫О©╫О©╫
                    ; О©╫О©╫О©╫О©╫О©╫о©О©╫ TSS О©╫О©╫О©╫в╦О©╫ф╝О©╫О©╫ О©╫н╣О©╫
    ret

; IDTR О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ IDT О©╫О©╫О©╫л╨О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
;   PARAM: IDT О©╫О©╫О©╫л╨О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫О©╫о╢О©╫ О©╫з╥А╠╦О©╫О©╫О©╫О©╫ О©╫О©╫Е╥╧О©╫О©?
kLoadIDTR:
    lidt [ rdi ]    ; О©╫д╤О©╫О©╫О©╫О©? 1(IDTRО©╫О©╫ О©╫О©╫Е╥╧О©╫О©?)О©╫О©╫ О©╫О©╫О©╫н╪О©╫О©╫О©╫О©╫О©╫ О©╫н╣О©╫О©╫о©О©╫
                    ; IDT О©╫О©╫О©╫л╨О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
    ret

; О©╫О©╫О©╫м╥О©╫ф╝О©╫О©╫ х╟О©╫О©╫х╜
;   PARAM: О©╫О©╫О©╫О©╫
kEnableInterrupt:
    sti             ; О©╫О©╫О©╫м╥О©╫ф╝О©╫О©╫ х╟О©╫О©╫х╜
    ret

; О©╫О©╫О©╫м╥О©╫ф╝О©╫О©╫ О©╫О©╫х╟О©╫О©╫х╜
;   PARAM: О©╫О©╫О©╫О©╫
kDisableInterrupt:
    cli             ; О©╫О©╫О©╫м╥О©╫ф╝О©╫О©╫ О©╫О©╫х╟О©╫О©╫х╜
    ret

; RFLAGS О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ О©╫п╬Н╪╜ О©╫г╣О©╫О©╫О©╫О©╫О©╫
;   PARAM: О©╫О©╫О©╫О©╫
kReadRFLAGS:
    pushfq                  ; RFLAGS О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ О©╫О©╫О©╫ц©О©╫ О©╫О©╫О©╫О©╫
    pop rax                 ; О©╫О©╫О©╫ц©О©╫ О©╫О©╫О©╫О©╫О©? RFLAGS О©╫О©╫О©╫О©╫О©╫О©╫О©╫м╦О©╫ RAX О©╫О©╫О©╫О©╫О©╫О©╫О©╫м©О©╫ О©╫О©╫О©╫О©╫О©╫о©О©╫
                            ; О©╫т╪О©╫О©╫О©╫ О©╫О©╫х╞ О©╫О©╫О©╫О©╫О©╫О©╫ О©╫О©╫О©╫О©╫
    ret

getFaultAddress:
    mov rax, cr2
    ret

; ????·└ ?┼╓?┐╛?■└ Л╧╢Л ╢?└╟К╔? ?²╫?√╢?└° К╟≤М≥≤ 
;   PARAM: ?≈├?²▄    
kReadTSC:
    push rdx                ; RDX ?═┬Л╖??┼╓?└╟К╔? ?┼╓?┐²?≈░ ????·╔
    
    rdtsc                   ; ????·└ ?┼╓?┐╛?■└ Л╧╢Л ╢?└╟К╔? ?²╫?√╢?└° RDX:RAX?≈░ ????·╔
    
    shl rdx, 32             ; RDX ?═┬Л╖??┼╓?└╟?≈░ ?·┬?┼■ ?┐│?°└ 32К╧└М┼╦ TSC Й╟▓ЙЁ╪ RAX ?═┬Л╖??┼╓?└╟?≈░
    or rax, rdx             ; ?·┬?┼■ ?∙≤?°└ 32К╧└М┼╦ TSC Й╟▓Л²└ OR?∙≤?≈╛ RAX ?═┬Л╖??┼╓?└╟?≈░ 64К╧└М┼╦ 
                            ; TSC Й╟▓Л²└ ????·╔
    
    pop rdx
    ret
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;
;   ?┐°?┼╓?│╛ Й╢??═╗ ?√╢?┘┬К╦■К╕╛?√╢ ?∙╗?┬≤
;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Л╫≤М┘█?┼╓?┼╦К╔? ????·╔?∙≤ЙЁ? ????═┴?└╟К╔? Й╣░Л╡╢?∙≤?┼■ К╖╓М│╛К║?
%macro KSAVECONTEXT 0       ; ?▄▄?²╪К╞╦М└╟К╔? ?═└?▀╛К╟⌡Л?? ?∙┼?┼■ KSAVECONTEXT К╖╓М│╛К║? ?═∙?²≤
    ; RBP ?═┬Л╖??┼╓?└╟К╤??└╟ GS ?└╦Й╥╦К╗╪?┼╦ ????═┴?└╟Й╧▄Л?? К╙╗К▒░ ?┼╓?┐²?≈░ ?┌╫?·┘
    push rbp
    push rax
    push rbx
    push rcx
    push rdx
    push rdi
    push rsi
    push r8
    push r9
    push r10
    push r11
    push r12
    push r13
    push r14
    push r15
    
    mov ax, ds      ; DS ?└╦Й╥╦К╗╪?┼╦ ????═┴?└╟??? ES ?└╦Й╥╦К╗╪?┼╦ ????═┴?└╟?┼■ ?┼╓?┐²?≈░ Л╖│Л═▒
    push rax        ; ?┌╫?·┘?∙═ ?┬≤ ?≈├?°╪К╞?К║?, RAX ?═┬Л╖??┼╓?└╟?≈░ ????·╔?∙° ?⌡└ ?┼╓?┐²?≈░ ?┌╫?·┘
    mov ax, es
    push rax
    push fs
    push gs 
%endmacro       ; К╖╓М│╛К║? ?│²


; Л╫≤М┘█?┼╓?┼╦К╔? КЁ╣Л⌡░?∙≤?┼■ К╖╓М│╛К║?
%macro KLOADCONTEXT 0   ; ?▄▄?²╪К╞╦М└╟К╔? ?═└?▀╛К╟⌡Л?? ?∙┼?┼■ KSAVECONTEXT К╖╓М│╛К║? ?═∙?²≤
    ; GS ?└╦Й╥╦К╗╪?┼╦ ????═┴?└╟К╤??└╟ RBP ?═┬Л╖??┼╓?└╟Й╧▄Л?? К╙╗К▒░ ?┼╓?┐²?≈░?└° Й╨╪К┌╢ КЁ╣Л⌡░
    pop gs
    pop fs
    pop rax
    mov es, ax      ; ES ?└╦Й╥╦К╗╪?┼╦ ????═┴?└╟??? DS ?└╦Й╥╦К╗╪?┼╦ ????═┴?└╟?┼■ ?┼╓?┐²?≈░?└° Л╖│Л═▒
    pop rax         ; Й╨╪К┌╢ КЁ╣Л⌡░?∙═ ?┬≤ ?≈├?°╪К╞?К║?, RAX ?═┬Л╖??┼╓?└╟?≈░ ????·╔?∙° ?▓╓?≈░ КЁ╣Л⌡░
    mov ds, ax
    
    pop r15
    pop r14
    pop r13
    pop r12
    pop r11
    pop r10
    pop r9
    pop r8
    pop rsi
    pop rdi
    pop rdx
    pop rcx
    pop rbx
    pop rax
    pop rbp        
%endmacro       ; К╖╓М│╛К║? ?│²

; Current Context?≈░ ?≤└?·╛ Л╫≤М┘█?┼╓?┼╦К╔? ????·╔?∙≤ЙЁ? Next Task?≈░?└° Л╫≤М┘█?┼╓?┼╦К╔? КЁ╣Й╣╛
;   PARAM: Current Context, Next Context
kSwitchContext:
    push rbp        ; ?┼╓?┐²?≈░ RBP ?═┬Л╖??┼╓?└╟К╔? ????·╔?∙≤ЙЁ? RSP ?═┬Л╖??┼╓?└╟К╔? RBP?≈░ ????·╔
    mov rbp, rsp
    
    ; Current ContextЙ╟? NULL?²╢К╘? Л╫≤М┘█?┼╓?┼╦К╔? ????·╔?∙═ ?∙└? ■ ?≈├?²▄
    pushfq          ; ?∙└?·≤?²≤ cmp?²≤ Й╡╟ЙЁ╪К║? RFLAGS ?═┬Л╖??┼╓?└╟Й╟? КЁ??∙≤Л╖? ?∙┼?▐└К║? ?┼╓?┐²?≈░ ????·╔
    cmp rdi, 0      ; Current ContextЙ╟? NULL?²╢К╘? Л╫≤М┘█?┼╓?┼╦ КЁ╣Л⌡░?°╪К║? К╟■К║° ?²╢?▐≥
    je .LoadContext 
    popfq           ; ?┼╓?┐²?≈░ ????·╔?∙° RFLAGS ?═┬Л╖??┼╓?└╟К╔? КЁ╣Л⌡░

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; ?≤└?·╛ ?┐°?┼╓?│╛?²≤ Л╫≤М┘█?┼╓?┼╦К╔? ????·╔
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    push rax            ; Л╫≤М┘█?┼╓?┼╦ ?≤│?≈╜?²≤ ?≤╓?■└?┘▀?°╪К║? ?┌╛? ╘?∙═ RAX ?═┬Л╖??┼╓?└╟К╔? ?┼╓?┐²?≈░ ????·╔
    
    ; SS, RSP, RFLAGS, CS, RIP ?═┬Л╖??┼╓?└╟ ?┬°?└°???К║? ?┌╫?·┘
    mov ax, ss                          ; SS ?═┬Л╖??┼╓?└╟ ????·╔
    mov qword[ rdi + ( 23 * 8 ) ], rax

    mov rax, rbp                        ; RBP?≈░ ????·╔?░° RSP ?═┬Л╖??┼╓?└╟ ????·╔
    add rax, 16                         ; RSP ?═┬Л╖??┼╓?└╟?┼■ push rbp??? Return AddressК╔?
    mov qword[ rdi + ( 22 * 8 ) ], rax  ; ?═°?≥╦?∙° Й╟▓Л°╪К║? ????·╔
    
    pushfq                              ; RFLAGS ?═┬Л╖??┼╓?└╟ ????·╔
    pop rax
    mov qword[ rdi + ( 21 * 8 ) ], rax

    mov ax, cs                          ; CS ?═┬Л╖??┼╓?└╟ ????·╔
    mov qword[ rdi + ( 20 * 8 ) ], rax
    
    mov rax, qword[ rbp + 8 ]           ; RIP ?═┬Л╖??┼╓?└╟К╔? Return AddressК║? ?└╓?═∙?∙≤?≈╛ 
    mov qword[ rdi + ( 19 * 8 ) ], rax  ; ?▀╓?²▄ Л╫≤М┘█?┼╓?┼╦ КЁ╣Л⌡░ ?▀°?≈░ ?²╢ ?∙╗?┬≤К╔? ?≤╦Л╤°М∙° 
                                        ; ?°└Л╧≤К║° ?²╢?▐≥?∙≤Й╡? ?∙╗
    
    ; ????·╔?∙° ?═┬Л╖??┼╓?└╟К╔? КЁ╣Й╣╛?∙° ?⌡└ ?²╦?└╟?÷╫?┼╦Й╟? К╟°Л┐²?√┬?²└ ?∙▄Л╡≤К÷╪ ?┌≤К╗╦Л?? Л╫≤М┘█?┼╓?┼╦К╔? К╙╗К▒░ ????·╔
    pop rax
    pop rbp
    
    ; Й╟??·╔ ?│²К╤?К╤└Л≈░ SS, RSP, RFLAGS, CS, RIP ?═┬Л╖??┼╓?└╟К╔? ????·╔?√┬?°╪К╞?К║?, ?²╢?═└ ?≤│?≈╜?≈░
    ; push К╙┘К═╧?√╢К║? Л╫≤М┘█?┼╓?┼╦К╔? ????·╔?∙≤Й╦? ?°└?∙╢ ?┼╓?┐²?²└ КЁ?Й╡?
    add rdi, ( 19 * 8 )
    mov rsp, rdi
    sub rdi, ( 19 * 8 )
    
    ; ?┌≤К╗╦Л?? ?═┬Л╖??┼╓?└╟К╔? К╙╗К▒░ Context ?·░Кё▄Й╣╛Л║╟Л≈░ ????·╔
    KSAVECONTEXT

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; ?▀╓?²▄ ?┐°?┼╓?│╛?²≤ Л╫≤М┘█?┼╓?┼╦ КЁ╣Л⌡░
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
.LoadContext:
    mov rsp, rsi
    
    ; Context ?·░Кё▄Й╣╛Л║╟Л≈░?└° ?═┬Л╖??┼╓?└╟К╔? КЁ╣Л⌡░
    KLOADCONTEXT
    iretq

; га╥н╪╪╪╜╦╕ ╫╛╟т гт
;   PARAM: ╬Ью╫
kHlt:
    hlt     ; га╥н╪╪╪╜╦╕ ╢К╠Б ╩Себ╥н аЬют╫це╢
    hlt
    ret
    
; ев╫╨ф╝©м ╪Ёа╓ю╩ гоЁ╙юг ╦М╥ию╦╥н цЁ╦╝
;	Destination╟З Compare╦╕ ╨Я╠Ёго©╘ ╟╟╢ы╦И, Destination©║ Source ╟╙ю╩ ╩Пют
;   PARAM: ╟╙ю╩ юЗюЕгр ╬Н╣Е╥╧╫╨(Destination, rdi), ╨Я╠Ёгр ╟╙(Compare, rsi), 
;          ╪Ёа╓гр ╟╙(Source, rdx) 
kTestAndSet:
    mov rax, rsi        ; ╣н ╧Ьб╟ фд╤С╧лемюн ╨Я╠Ёгр ╟╙ю╩ RAX ╥╧аЖ╫╨ем©║ юЗюЕ 
    
    ; RAX ╥╧аЖ╫╨ем©║ юЗюЕ╣х ╨Я╠Ёгр ╟╙╟З ц╧ ╧Ьб╟ фд╤С╧лемюг ╦ч╦П╦╝ ╬Н╣Е╥╧╫╨юг ╟╙ю╩
    ; ╨Я╠Ёго©╘ ╣н ╟╙юл ╟╟╢ы╦И ╪╪ ╧Ьб╟ фд╤С╧лемюг ╟╙ю╩ ц╧ ╧Ьб╟ фд╤С╧лем╟║ ╟║╦╝е╟╢б
    ; ╬Н╣Е╥╧╫╨©║ ╩Пют
    lock cmpxchg byte [ rdi ], dl
    je .SUCCESS         ; ZF ╨Яф╝╟║ 1юл╦И ╟╟╢ы╢б ╤Фюл╧г╥н .SUCCESS╥н юл╣©
    
.NOTSAME:               ; Destination╟З Compare╟║ ╢ы╦╔ ╟Ф©Л
    mov rax, 0x00
    ret
    
.SUCCESS:               ; Destination╟З Compare╟║ ╟╟ю╨ ╟Ф©Л
    mov rax, 0x01
    ret


