# file      VirtualOS.asm
# date      2008/11/27
# author    kkamagui 
# brief     °¡»ó OS ÀÌ¹ÌÁöžŠ žžµé±â À§ÇÑ ŒÒœº ÆÄÀÏ

[ORG 0x00]          ; ÄÚµåÀÇ œÃÀÛ Ÿîµå·¹œºžŠ 0x00Àž·Î Œ³Á€
[BITS 16]           ; ÀÌÇÏÀÇ ÄÚµåŽÂ 16ºñÆ® ÄÚµå·Î Œ³Á€

SECTION .text       ; text ŒœŒÇ(ŒŒ±×žÕÆ®)À» Á€ÀÇ

jmp 0x1000:START   ; CS ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ 0x1000À» º¹»çÇÏžéŒ­, START ·¹ÀÌºí·Î ÀÌµ¿

SECTORCOUNT:        dw  0x0000      ; ÇöÀç œÇÇà ÁßÀÎ ŒœÅÍ ¹øÈ£žŠ ÀúÀå
TOTALSECTORCOUNT    equ 1024        ; °¡»ó OSÀÇ ÃÑ ŒœÅÍ Œö. 
                                    ; ÃÖŽë 1152 ŒœÅÍ(0x90000byte)±îÁö °¡ŽÉ

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   ÄÚµå ¿µ¿ª
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
START:
    mov ax, cs                  ; CS ŒŒ±×žÕÆ® ·¹ÁöœºÅÍÀÇ °ªÀ» AX ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mov ds, ax                  ; AX ·¹ÁöœºÅÍÀÇ °ªÀ» DS ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mov ax, 0xB800              ; ºñµð¿À žÞžðž® Ÿîµå·¹œºÀÎ 0x0B8000À» ŒŒ±×žÕÆ®
                                ; ·¹ÁöœºÅÍ °ªÀž·Î º¯È¯
    mov es, ax                  ; ES ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ Œ³Á€

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; °¢ ŒœÅÍ º°·Î ÄÚµåžŠ »ýŒº
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    %assign i   0               ; i¶óŽÂ º¯ŒöžŠ ÁöÁ€ÇÏ°í 0Àž·Î ÃÊ±âÈ­
    %rep TOTALSECTORCOUNT       ; TOTALSECTORCOUNT¿¡ ÀúÀåµÈ °ªžžÅ­ ŸÆ·¡ ÄÚµåžŠ ¹Ýº¹
        %assign i   i + 1       ; ižŠ 1 Áõ°¡
    
        ; ÇöÀç œÇÇà ÁßÀÎ ÄÚµå°¡ Æ÷ÇÔµÈ ŒœÅÍÀÇ À§Ä¡žŠ È­žé ÁÂÇ¥·Î º¯È¯
        mov ax, 2                       ; ÇÑ ¹®ÀÚžŠ ³ªÅž³»ŽÂ ¹ÙÀÌÆ® Œö(2)žŠ 
                                        ; AX ·¹ÁöœºÅÍ¿¡ Œ³Á€
        mul word [ SECTORCOUNT ]        ; AX ·¹ÁöœºÅÍ¿Í ŒœÅÍ ŒöžŠ °öÇÔ
        mov si, ax                      ; °öÇÑ °á°úžŠ SI ·¹ÁöœºÅÍ¿¡ Œ³Á€

        ; °è»êµÈ °á°úžŠ ºñµð¿À žÞžðž®¿¡ ¿ÀÇÁŒÂÀž·Î »ïŸÆ ŒŒ ¹øÂ° ¶óÀÎºÎÅÍ È­žé¿¡
        ; 0À» Ãâ·Â
        mov byte [ es: si + ( 160 * 3 ) ], '0' + ( i % 10 )
        add word [ SECTORCOUNT ], 1     ; ŒœÅÍ ŒöžŠ 1 Áõ°¡

        ; ž¶Áöž· ŒœÅÍÀÌžé Žõ ŒöÇàÇÒ ŒœÅÍ°¡ ŸøÀž¹Ç·Î ¹«ÇÑ ·çÇÁ ŒöÇà, ±×·žÁö ŸÊÀžžé
        ; ŽÙÀœ ŒœÅÍ·Î ÀÌµ¿ÇØŒ­ ÄÚµå ŒöÇà
        %if i == TOTALSECTORCOUNT       ; i°¡ TOTALSECTORCOUNT¿Í °°ŽÙžé, 
                                        ; Áï ž¶Áöž· ŒœÅÍÀÌžé
            jmp $                       ; ÇöÀç À§Ä¡¿¡Œ­ ¹«ÇÑ ·çÇÁ ŒöÇà
        %else                           ; ž¶Áöž· ŒœÅÍ°¡ ŸÆŽÏžé
            jmp ( 0x1000 + i * 0x20 ): 0x0000   ; ŽÙÀœ ŒœÅÍ ¿ÀÇÁŒÂÀž·Î ÀÌµ¿
        %endif                          ; if¹®ÀÇ ³¡
        
        times ( 512 - ( $ - $$ ) % 512 )    db 0x00    ; $ ÇöÀç ¶óÀÎÀÇ Ÿîµå·¹œº
                            ; $$ ÇöÀç ŒœŒÇ(.text)ÀÇ œÃÀÛ Ÿîµå·¹œº
                            ; $ - $$ ÇöÀç ŒœŒÇÀ» ±âÁØÀž·Î ÇÏŽÂ ¿ÀÇÁŒÂ
                            ; 512 - ( $ - $$ ) % 512 ÇöÀçºÎÅÍ Ÿîµå·¹œº 512±îÁö
                            ; db 0x00 1¹ÙÀÌÆ®žŠ Œ±ŸðÇÏ°í °ªÀº 0x00
                            ; time ¹Ýº¹ ŒöÇà
                            ; ÇöÀç À§Ä¡¿¡Œ­ Ÿîµå·¹œº 512±îÁö 0x00Àž·Î Ã€¿ò
    %endrep                 ; ¹Ýº¹¹®ÀÇ ³¡