# file      BootLoader.asm
# date      2008/11/27
# author    kkamagui 
#           Copyright(c)2008 All rights reserved by kkamagui
# brief     MINT64 OSÀÇ ºÎÆ® ·ÎŽõ ŒÒœº ÆÄÀÏ

[ORG 0x00]          ; ÄÚµåÀÇ œÃÀÛ Ÿîµå·¹œºžŠ 0x00Àž·Î Œ³Á€
[BITS 16]           ; ÀÌÇÏÀÇ ÄÚµåŽÂ 16ºñÆ® ÄÚµå·Î Œ³Á€

SECTION .text       ; text ŒœŒÇ(ŒŒ±×žÕÆ®)À» Á€ÀÇ

jmp 0x07C0:START    ; CS ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ 0x07C0À» º¹»çÇÏžéŒ­, START ·¹ÀÌºí·Î ÀÌµ¿

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   MINT64 OS¿¡ °ü·ÃµÈ È¯°æ Œ³Á€ °ª
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
TOTALSECTORCOUNT:   dw  1024    ; ºÎÆ® ·ÎŽõžŠ ÁŠ¿ÜÇÑ MINT64 OS ÀÌ¹ÌÁöÀÇ Å©±â
                                ; ÃÖŽë 1152 ŒœÅÍ(0x90000byte)±îÁö °¡ŽÉ

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   ÄÚµå ¿µ¿ª
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
START:
    mov ax, 0x07C0  ; ºÎÆ® ·ÎŽõÀÇ œÃÀÛ Ÿîµå·¹œº(0x7C00)žŠ ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ °ªÀž·Î º¯È¯
    mov ds, ax      ; DS ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mov ax, 0xB800  ; ºñµð¿À žÞžðž®ÀÇ œÃÀÛ Ÿîµå·¹œº(0xB800)žŠ ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ °ªÀž·Î º¯È¯
    mov es, ax      ; ES ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ Œ³Á€

    ; œºÅÃÀ» 0x0000:0000~0x0000:FFFF ¿µ¿ª¿¡ 64Kb Å©±â·Î »ýŒº
    mov ax, 0x0000  ; œºÅÃ ŒŒ±×žÕÆ®ÀÇ œÃÀÛ Ÿîµå·¹œº(0x0000)žŠ ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ °ªÀž·Î º¯È¯
    mov ss, ax      ; SS ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mov sp, 0xFFFE  ; SP ·¹ÁöœºÅÍÀÇ Ÿîµå·¹œºžŠ 0xFFFE·Î Œ³Á€
    mov bp, 0xFFFE  ; BP ·¹ÁöœºÅÍÀÇ Ÿîµå·¹œºžŠ 0xFFFE·Î Œ³Á€

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; È­žéÀ» žðµÎ Áö¿ì°í, ŒÓŒº°ªÀ» ³ì»öÀž·Î Œ³Á€
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    mov si,    0                    ; SI ·¹ÁöœºÅÍ(¹®ÀÚ¿­ ¿øº» ÀÎµŠœº ·¹ÁöœºÅÍ)žŠ ÃÊ±âÈ­
        
.SCREENCLEARLOOP:                   ; È­žéÀ» Áö¿ìŽÂ ·çÇÁ
    mov byte [ es: si ], 0          ; ºñµð¿À žÞžðž®ÀÇ ¹®ÀÚ°¡ À§Ä¡ÇÏŽÂ Ÿîµå·¹œº¿¡
                                    ; 0À» º¹»çÇÏ¿© ¹®ÀÚžŠ »èÁŠ
    mov byte [ es: si + 1 ], 0x0A   ; ºñµð¿À žÞžðž®ÀÇ ŒÓŒºÀÌ À§Ä¡ÇÏŽÂ Ÿîµå·¹œº¿¡
                                    ; 0x0A(°ËÀº ¹ÙÅÁ¿¡ ¹àÀº ³ì»ö)À» º¹»ç


    add si, 2                       ; ¹®ÀÚ¿Í ŒÓŒºÀ» Œ³Á€ÇßÀž¹Ç·Î ŽÙÀœ À§Ä¡·Î ÀÌµ¿

    cmp si, 80 * 25 * 2     ; È­žéÀÇ ÀüÃŒ Å©±âŽÂ 80 ¹®ÀÚ * 25 ¶óÀÎÀÓ
                            ; Ãâ·ÂÇÑ ¹®ÀÚÀÇ ŒöžŠ ÀÇ¹ÌÇÏŽÂ SI ·¹ÁöœºÅÍ¿Í ºñ±³
    jl .SCREENCLEARLOOP     ; SI ·¹ÁöœºÅÍ°¡ 80 * 25 * 2ºžŽÙ ÀÛŽÙžé ŸÆÁ÷ Áö¿ìÁö 
                            ; žøÇÑ ¿µ¿ªÀÌ ÀÖÀž¹Ç·Î .SCREENCLEARLOOP ·¹ÀÌºí·Î ÀÌµ¿
    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; È­žé »óŽÜ¿¡ œÃÀÛ žÞœÃÁöžŠ Ãâ·Â
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    push MESSAGE1               ; Ãâ·ÂÇÒ žÞœÃÁöÀÇ Ÿîµå·¹œºžŠ œºÅÃ¿¡ »ðÀÔ
    push 0                      ; È­žé Y ÁÂÇ¥(0)žŠ œºÅÃ¿¡ »ðÀÔ
    push 0                      ; È­žé X ÁÂÇ¥(0)žŠ œºÅÃ¿¡ »ðÀÔ
    call PRINTMESSAGE           ; PRINTMESSAGE ÇÔŒö È£Ãâ
    add  sp, 6                  ; »ðÀÔÇÑ ÆÄ¶ó¹ÌÅÍ ÁŠ°Å
    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; OS ÀÌ¹ÌÁöžŠ ·ÎµùÇÑŽÙŽÂ žÞœÃÁö Ãâ·Â
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    push MESSAGE2    ; Ãâ·ÂÇÒ žÞœÃÁöÀÇ Ÿîµå·¹œºžŠ œºÅÃ¿¡ »ðÀÔ           
    push 1                      ; È­žé Y ÁÂÇ¥(1)žŠ œºÅÃ¿¡ »ðÀÔ                     
    push 0                      ; È­žé X ÁÂÇ¥(0)žŠ œºÅÃ¿¡ »ðÀÔ                     
    call PRINTMESSAGE           ; PRINTMESSAGE ÇÔŒö È£Ãâ                           
    add  sp, 6                  ; »ðÀÔÇÑ ÆÄ¶ó¹ÌÅÍ ÁŠ°Å  

;;;;;;;;;
    mov ax, 0xB800
    mov es, ax

    mov ax, 1
    mov si, 160
    mul si
    mov di, ax

    mov ax, 14
    mov si, 2
    mul si
    add di, ax

    mov ah, 2h
    int 1Ah

    mov ah, 0x0E
    mov al, ch
    and al, 0xF0
    shr al, 0x4
    add al, 0x30
    mov byte [ es: di ], al
    add di, 2

    mov al, ch
    and al, 0x0F
    add al, 0x30
    mov byte [ es: di ], al
    add di, 2

    mov byte [ es: di ], ':'
    add di, 2

    mov al, cl
    and al, 0xF0
    shr al, 0x4
    add al, 0x30
    mov byte [ es: di ], al
    add di, 2

    mov al, cl
    and al, 0x0F
    add al, 0x30
    mov byte [ es: di ], al
    add di, 2

    mov byte [ es: di ], ':'
    add di, 2

    mov al, dh
    and al, 0xF0
    shr al, 0x4
    add al, 0x30
    mov byte [ es: di ], al
    add di, 2

    mov al, dh
    and al, 0x0F
    add al, 0x30
    mov byte [ es: di ], al
    add di, 2
;;;;;;

    push IMAGELOADINGMESSAGE    ; Ãâ·ÂÇÒ žÞœÃÁöÀÇ Ÿîµå·¹œºžŠ œºÅÃ¿¡ »ðÀÔ           
    push 2                      ; È­žé Y ÁÂÇ¥(1)žŠ œºÅÃ¿¡ »ðÀÔ                     
    push 0                      ; È­žé X ÁÂÇ¥(0)žŠ œºÅÃ¿¡ »ðÀÔ                     
    call PRINTMESSAGE           ; PRINTMESSAGE ÇÔŒö È£Ãâ                           
    add  sp, 6                  ; »ðÀÔÇÑ ÆÄ¶ó¹ÌÅÍ ÁŠ°Å                             
        
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; µðœºÅ©¿¡Œ­ OS ÀÌ¹ÌÁöžŠ ·Îµù
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; µðœºÅ©žŠ ÀÐ±â Àü¿¡ žÕÀú ž®ŒÂ
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
RESETDISK:                          ; µðœºÅ©žŠ ž®ŒÂÇÏŽÂ ÄÚµåÀÇ œÃÀÛ
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; BIOS Reset Function È£Ãâ
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; Œ­ºñœº ¹øÈ£ 0, µå¶óÀÌºê ¹øÈ£(0=Floppy)
    mov ax, 0
    mov dl, 0              
    int 0x13     
    ; ¿¡·¯°¡ ¹ß»ýÇÏžé ¿¡·¯ Ã³ž®·Î ÀÌµ¿
    jc  HANDLEDISKERROR
        
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; µðœºÅ©¿¡Œ­ ŒœÅÍžŠ ÀÐÀœ
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; µðœºÅ©ÀÇ ³»¿ëÀ» žÞžðž®·Î º¹»çÇÒ Ÿîµå·¹œº(ES:BX)žŠ 0x10000Àž·Î Œ³Á€
    mov si, 0x1000                  ; OS ÀÌ¹ÌÁöžŠ º¹»çÇÒ Ÿîµå·¹œº(0x10000)žŠ 
                                    ; ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ °ªÀž·Î º¯È¯
    mov es, si                      ; ES ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ °ª Œ³Á€
    mov bx, 0x0000                  ; BX ·¹ÁöœºÅÍ¿¡ 0x0000À» Œ³Á€ÇÏ¿© º¹»çÇÒ 
                                    ; Ÿîµå·¹œºžŠ 0x1000:0000(0x10000)Àž·Î ÃÖÁŸ Œ³Á€

    mov di, word [ TOTALSECTORCOUNT ] ; º¹»çÇÒ OS ÀÌ¹ÌÁöÀÇ ŒœÅÍ ŒöžŠ DI ·¹ÁöœºÅÍ¿¡ Œ³Á€

READDATA:                           ; µðœºÅ©žŠ ÀÐŽÂ ÄÚµåÀÇ œÃÀÛ
    ; žðµç ŒœÅÍžŠ ŽÙ ÀÐŸúŽÂÁö È®ÀÎ
    cmp di, 0               ; º¹»çÇÒ OS ÀÌ¹ÌÁöÀÇ ŒœÅÍ ŒöžŠ 0°ú ºñ±³
    je  READEND             ; º¹»çÇÒ ŒœÅÍ Œö°¡ 0ÀÌ¶óžé ŽÙ º¹»ç ÇßÀž¹Ç·Î READEND·Î ÀÌµ¿
    sub di, 0x1             ; º¹»çÇÒ ŒœÅÍ ŒöžŠ 1 °šŒÒ

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; BIOS Read Function È£Ãâ
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    mov ah, 0x02                        ; BIOS Œ­ºñœº ¹øÈ£ 2(Read Sector)
    mov al, 0x1                         ; ÀÐÀ» ŒœÅÍ ŒöŽÂ 1
    mov ch, byte [ TRACKNUMBER ]        ; ÀÐÀ» Æ®·¢ ¹øÈ£ Œ³Á€
    mov cl, byte [ SECTORNUMBER ]       ; ÀÐÀ» ŒœÅÍ ¹øÈ£ Œ³Á€
    mov dh, byte [ HEADNUMBER ]         ; ÀÐÀ» Çìµå ¹øÈ£ Œ³Á€
    mov dl, 0x00                        ; ÀÐÀ» µå¶óÀÌºê ¹øÈ£(0=Floppy) Œ³Á€
    int 0x13                            ; ÀÎÅÍ·ŽÆ® Œ­ºñœº ŒöÇà
    jc HANDLEDISKERROR                  ; ¿¡·¯°¡ ¹ß»ýÇßŽÙžé HANDLEDISKERROR·Î ÀÌµ¿
    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; º¹»çÇÒ Ÿîµå·¹œº¿Í Æ®·¢, Çìµå, ŒœÅÍ Ÿîµå·¹œº °è»ê
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    add si, 0x0020      ; 512(0x200)¹ÙÀÌÆ®žžÅ­ ÀÐŸúÀž¹Ç·Î, ÀÌžŠ ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ
                        ; °ªÀž·Î º¯È¯
    mov es, si          ; ES ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ ŽõÇØŒ­ Ÿîµå·¹œºžŠ ÇÑ ŒœÅÍ žžÅ­ Áõ°¡
    
    ; ÇÑ ŒœÅÍžŠ ÀÐŸúÀž¹Ç·Î ŒœÅÍ ¹øÈ£žŠ Áõ°¡œÃÅ°°í ž¶Áöž· ŒœÅÍ(18)±îÁö ÀÐŸúŽÂÁö ÆÇŽÜ
    ; ž¶Áöž· ŒœÅÍ°¡ ŸÆŽÏžé ŒœÅÍ ÀÐ±â·Î ÀÌµ¿ÇØŒ­ ŽÙœÃ ŒœÅÍ ÀÐ±â ŒöÇà
    mov al, byte [ SECTORNUMBER ]       ; ŒœÅÍ ¹øÈ£žŠ AL ·¹ÁöœºÅÍ¿¡ Œ³Á€
    add al, 0x01                        ; ŒœÅÍ ¹øÈ£žŠ 1 Áõ°¡
    mov byte [ SECTORNUMBER ], al       ; Áõ°¡œÃÅ² ŒœÅÍ ¹øÈ£žŠ SECTORNUMBER¿¡ ŽÙœÃ Œ³Á€
    cmp al, 19                          ; Áõ°¡œÃÅ² ŒœÅÍ ¹øÈ£žŠ 19¿Í ºñ±³
    jl READDATA                         ; ŒœÅÍ ¹øÈ£°¡ 19 ¹ÌžžÀÌ¶óžé READDATA·Î ÀÌµ¿
    
    ; ž¶Áöž· ŒœÅÍ±îÁö ÀÐŸúÀžžé(ŒœÅÍ ¹øÈ£°¡ 19ÀÌžé) ÇìµåžŠ Åä±Û(0->1, 1->0)ÇÏ°í, 
    ; ŒœÅÍ ¹øÈ£žŠ 1·Î Œ³Á€
    xor byte [ HEADNUMBER ], 0x01       ; Çìµå ¹øÈ£žŠ 0x01°ú XORÇÏ¿© Åä±Û(0->1, 1->1)
    mov byte [ SECTORNUMBER ], 0x01     ; ŒœÅÍ ¹øÈ£žŠ ŽÙœÃ 1·Î Œ³Á€
    
    ; žžŸà Çìµå°¡ 1->0·Î ¹Ù²îŸúÀžžé ŸçÂÊ ÇìµåžŠ žðµÎ ÀÐÀº °ÍÀÌ¹Ç·Î ŸÆ·¡·Î ÀÌµ¿ÇÏ¿©
    ; Æ®·¢ ¹øÈ£žŠ 1 Áõ°¡
    cmp byte [ HEADNUMBER ], 0x00       ; Çìµå ¹øÈ£žŠ 0x00°ú ºñ±³
    jne READDATA                        ; Çìµå ¹øÈ£°¡ 0ÀÌ ŸÆŽÏžé READDATA·Î ÀÌµ¿
    
    ; Æ®·¢À» 1 Áõ°¡œÃÅ² ÈÄ, ŽÙœÃ ŒœÅÍ ÀÐ±â·Î ÀÌµ¿
    add byte [ TRACKNUMBER ], 0x01      ; Æ®·¢ ¹øÈ£žŠ 1 Áõ°¡
    jmp READDATA                        ; READDATA·Î ÀÌµ¿
READEND:

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; OS ÀÌ¹ÌÁö°¡ ¿Ï·áµÇŸúŽÙŽÂ žÞœÃÁöžŠ Ãâ·Â
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    push LOADINGCOMPLETEMESSAGE     ; Ãâ·ÂÇÒ žÞœÃÁöÀÇ Ÿîµå·¹œºžŠ œºÅÃ¿¡ »ðÀÔ
    push 2                          ; È­žé Y ÁÂÇ¥(1)žŠ œºÅÃ¿¡ »ðÀÔ
    push 20                         ; È­žé X ÁÂÇ¥(20)žŠ œºÅÃ¿¡ »ðÀÔ
    call PRINTMESSAGE               ; PRINTMESSAGE ÇÔŒö È£Ãâ
    add  sp, 6                      ; »ðÀÔÇÑ ÆÄ¶ó¹ÌÅÍ ÁŠ°Å

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; ·ÎµùÇÑ °¡»ó OS ÀÌ¹ÌÁö œÇÇà    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    jmp 0x1000:0x0000
    
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   ÇÔŒö ÄÚµå ¿µ¿ª
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; µðœºÅ© ¿¡·¯žŠ Ã³ž®ÇÏŽÂ ÇÔŒö   
HANDLEDISKERROR:
    push DISKERRORMESSAGE   ; ¿¡·¯ ¹®ÀÚ¿­ÀÇ Ÿîµå·¹œºžŠ œºÅÃ¿¡ »ðÀÔ
    push 2                  ; È­žé Y ÁÂÇ¥(1)žŠ œºÅÃ¿¡ »ðÀÔ
    push 20                 ; È­žé X ÁÂÇ¥(20)žŠ œºÅÃ¿¡ »ðÀÔ
    call PRINTMESSAGE       ; PRINTMESSAGE ÇÔŒö È£Ãâ
    
    jmp $                   ; ÇöÀç À§Ä¡¿¡Œ­ ¹«ÇÑ ·çÇÁ ŒöÇà

; žÞœÃÁöžŠ Ãâ·ÂÇÏŽÂ ÇÔŒö
;   PARAM: x ÁÂÇ¥, y ÁÂÇ¥, ¹®ÀÚ¿­
PRINTMESSAGE:
    push bp         ; º£ÀÌœº Æ÷ÀÎÅÍ ·¹ÁöœºÅÍ(BP)žŠ œºÅÃ¿¡ »ðÀÔ
    mov bp, sp      ; º£ÀÌœº Æ÷ÀÎÅÍ ·¹ÁöœºÅÍ(BP)¿¡ œºÅÃ Æ÷ÀÎÅÍ ·¹ÁöœºÅÍ(SP)ÀÇ °ªÀ» Œ³Á€
                    ; º£ÀÌœº Æ÷ÀÎÅÍ ·¹ÁöœºÅÍ(BP)žŠ ÀÌ¿ëÇØŒ­ ÆÄ¶ó¹ÌÅÍ¿¡ Á¢±ÙÇÒ žñÀû

    push es         ; ES ŒŒ±×žÕÆ® ·¹ÁöœºÅÍºÎÅÍ DX ·¹ÁöœºÅÍ±îÁö œºÅÃ¿¡ »ðÀÔ
    push si         ; ÇÔŒö¿¡Œ­ ÀÓœÃ·Î »ç¿ëÇÏŽÂ ·¹ÁöœºÅÍ·Î ÇÔŒöÀÇ ž¶Áöž· ºÎºÐ¿¡Œ­
    push di         ; œºÅÃ¿¡ »ðÀÔµÈ °ªÀ» ²š³» ¿ø·¡ °ªÀž·Î º¹¿ø
    push ax
    push cx
    push dx
    
    ; ES ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ ºñµð¿À žðµå Ÿîµå·¹œº Œ³Á€
    mov ax, 0xB800              ; ºñµð¿À žÞžðž® œÃÀÛ Ÿîµå·¹œº(0x0B8000)žŠ 
                                ; ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ °ªÀž·Î º¯È¯
    mov es, ax                  ; ES ŒŒ±×žÕÆ® ·¹ÁöœºÅÍ¿¡ Œ³Á€
    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; X, YÀÇ ÁÂÇ¥·Î ºñµð¿À žÞžðž®ÀÇ Ÿîµå·¹œºžŠ °è»êÇÔ
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; Y ÁÂÇ¥žŠ ÀÌ¿ëÇØŒ­ žÕÀú ¶óÀÎ Ÿîµå·¹œºžŠ ±žÇÔ
    mov ax, word [ bp + 6 ]     ; ÆÄ¶ó¹ÌÅÍ 2(È­žé ÁÂÇ¥ Y)žŠ AX ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mov si, 160                 ; ÇÑ ¶óÀÎÀÇ ¹ÙÀÌÆ® Œö(2 * 80 ÄÃ·³)žŠ SI ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mul si                      ; AX ·¹ÁöœºÅÍ¿Í SI ·¹ÁöœºÅÍžŠ °öÇÏ¿© È­žé Y Ÿîµå·¹œº °è»ê
    mov di, ax                  ; °è»êµÈ È­žé Y Ÿîµå·¹œºžŠ DI ·¹ÁöœºÅÍ¿¡ Œ³Á€
    
    ; X ÁÂ·ážŠ ÀÌ¿ëÇØŒ­ 2žŠ °öÇÑ ÈÄ ÃÖÁŸ Ÿîµå·¹œºžŠ ±žÇÔ
    mov ax, word [ bp + 4 ]     ; ÆÄ¶ó¹ÌÅÍ 1(È­žé ÁÂÇ¥ X)žŠ AX ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mov si, 2                   ; ÇÑ ¹®ÀÚžŠ ³ªÅž³»ŽÂ ¹ÙÀÌÆ® Œö(2)žŠ SI ·¹ÁöœºÅÍ¿¡ Œ³Á€
    mul si                      ; AX ·¹ÁöœºÅÍ¿Í SI ·¹ÁöœºÅÍžŠ °öÇÏ¿© È­žé X Ÿîµå·¹œºžŠ °è»ê
    add di, ax                  ; È­žé Y Ÿîµå·¹œº¿Í °è»êµÈ X Ÿîµå·¹œºžŠ ŽõÇØŒ­
                                ; œÇÁŠ ºñµð¿À žÞžðž® Ÿîµå·¹œºžŠ °è»ê
    
    ; Ãâ·ÂÇÒ ¹®ÀÚ¿­ÀÇ Ÿîµå·¹œº      
    mov si, word [ bp + 8 ]     ; ÆÄ¶ó¹ÌÅÍ 3(Ãâ·ÂÇÒ ¹®ÀÚ¿­ÀÇ Ÿîµå·¹œº)

.MESSAGELOOP:               ; žÞœÃÁöžŠ Ãâ·ÂÇÏŽÂ ·çÇÁ
    mov cl, byte [ si ]     ; SI ·¹ÁöœºÅÍ°¡ °¡ž®Å°ŽÂ ¹®ÀÚ¿­ À§Ä¡¿¡Œ­ ÇÑ ¹®ÀÚžŠ 
                            ; CL ·¹ÁöœºÅÍ¿¡ º¹»ç
                            ; CL ·¹ÁöœºÅÍŽÂ CX ·¹ÁöœºÅÍÀÇ ÇÏÀ§ 1¹ÙÀÌÆ®žŠ ÀÇ¹Ì
                            ; ¹®ÀÚ¿­Àº 1¹ÙÀÌÆ®žé ÃæºÐÇÏ¹Ç·Î CX ·¹ÁöœºÅÍÀÇ ÇÏÀ§ 1¹ÙÀÌÆ®žž »ç¿ë
    
    cmp cl, 0               ; º¹»çµÈ ¹®ÀÚ¿Í 0À» ºñ±³
    je .MESSAGEEND          ; º¹»çÇÑ ¹®ÀÚÀÇ °ªÀÌ 0ÀÌžé ¹®ÀÚ¿­ÀÌ ÁŸ·áµÇŸúÀœÀ»
                            ; ÀÇ¹ÌÇÏ¹Ç·Î .MESSAGEEND·Î ÀÌµ¿ÇÏ¿© ¹®ÀÚ Ãâ·Â ÁŸ·á

    mov byte [ es: di ], cl ; 0ÀÌ ŸÆŽÏ¶óžé ºñµð¿À žÞžðž® Ÿîµå·¹œº 0xB800:di¿¡ ¹®ÀÚžŠ Ãâ·Â
    
    add si, 1               ; SI ·¹ÁöœºÅÍ¿¡ 1À» ŽõÇÏ¿© ŽÙÀœ ¹®ÀÚ¿­·Î ÀÌµ¿
    add di, 2               ; DI ·¹ÁöœºÅÍ¿¡ 2žŠ ŽõÇÏ¿© ºñµð¿À žÞžðž®ÀÇ ŽÙÀœ ¹®ÀÚ À§Ä¡·Î ÀÌµ¿
                            ; ºñµð¿À žÞžðž®ŽÂ (¹®ÀÚ, ŒÓŒº)ÀÇ œÖÀž·Î ±žŒºµÇ¹Ç·Î ¹®ÀÚžž Ãâ·ÂÇÏ·Ážé
                            ; 2žŠ ŽõÇØŸß ÇÔ

    jmp .MESSAGELOOP        ; žÞœÃÁö Ãâ·Â ·çÇÁ·Î ÀÌµ¿ÇÏ¿© ŽÙÀœ ¹®ÀÚžŠ Ãâ·Â

.MESSAGEEND:
    pop dx      ; ÇÔŒö¿¡Œ­ »ç¿ëÀÌ ³¡³­ DX ·¹ÁöœºÅÍºÎÅÍ ES ·¹ÁöœºÅÍ±îÁöžŠ œºÅÃ¿¡
    pop cx      ; »ðÀÔµÈ °ªÀ» ÀÌ¿ëÇØŒ­ º¹¿ø
    pop ax      ; œºÅÃÀº °¡Àå ž¶Áöž·¿¡ µéŸî°£ µ¥ÀÌÅÍ°¡ °¡Àå žÕÀú ³ª¿ÀŽÂ 
    pop di      ; ÀÚ·á±žÁ¶(Last-In, First-Out)ÀÌ¹Ç·Î »ðÀÔ(push)ÀÇ ¿ªŒøÀž·Î
    pop si      ; ÁŠ°Å(pop) ÇØŸß ÇÔ
    pop es
    pop bp      ; º£ÀÌœº Æ÷ÀÎÅÍ ·¹ÁöœºÅÍ(BP) º¹¿ø
    ret         ; ÇÔŒöžŠ È£ÃâÇÑ ŽÙÀœ ÄÚµåÀÇ À§Ä¡·Î º¹±Í
    
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;   µ¥ÀÌÅÍ ¿µ¿ª
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; ºÎÆ® ·ÎŽõ œÃÀÛ žÞœÃÁö
MESSAGE1:    db 'MINT64 OS Boot Loader Start~!!', 0 ; Ãâ·ÂÇÒ žÞœÃÁö Á€ÀÇ
                                                    ; ž¶Áöž·Àº 0Àž·Î Œ³Á€ÇÏ¿© .MESSAGELOOP¿¡Œ­ 
                                                    ; ¹®ÀÚ¿­ÀÌ ÁŸ·áµÇŸúÀœÀ» ŸË Œö ÀÖµµ·Ï ÇÔ
MESSAGE2:   db 'Current time: ', 0

DISKERRORMESSAGE:       db  'DISK Error~!!', 0
IMAGELOADINGMESSAGE:    db  'OS Image Loading...', 0
LOADINGCOMPLETEMESSAGE: db  'Complete~!!', 0

; µðœºÅ© ÀÐ±â¿¡ °ü·ÃµÈ º¯Œöµé
SECTORNUMBER:           db  0x02    ; OS ÀÌ¹ÌÁö°¡ œÃÀÛÇÏŽÂ ŒœÅÍ ¹øÈ£žŠ ÀúÀåÇÏŽÂ ¿µ¿ª
HEADNUMBER:             db  0x00    ; OS ÀÌ¹ÌÁö°¡ œÃÀÛÇÏŽÂ Çìµå ¹øÈ£žŠ ÀúÀåÇÏŽÂ ¿µ¿ª
TRACKNUMBER:            db  0x00    ; OS ÀÌ¹ÌÁö°¡ œÃÀÛÇÏŽÂ Æ®·¢ ¹øÈ£žŠ ÀúÀåÇÏŽÂ ¿µ¿ª
    
times 510 - ( $ - $$ )    db    0x00    ; $ : ÇöÀç ¶óÀÎÀÇ Ÿîµå·¹œº
                                        ; $$ : ÇöÀç ŒœŒÇ(.text)ÀÇ œÃÀÛ Ÿîµå·¹œº
                                        ; $ - $$ : ÇöÀç ŒœŒÇÀ» ±âÁØÀž·Î ÇÏŽÂ ¿ÀÇÁŒÂ
                                        ; 510 - ( $ - $$ ) : ÇöÀçºÎÅÍ Ÿîµå·¹œº 510±îÁö
                                        ; db 0x00 : 1¹ÙÀÌÆ®žŠ Œ±ŸðÇÏ°í °ªÀº 0x00
                                        ; time : ¹Ýº¹ ŒöÇà
                                        ; ÇöÀç À§Ä¡¿¡Œ­ Ÿîµå·¹œº 510±îÁö 0x00Àž·Î Ã€¿ò

db 0x55             ; 1¹ÙÀÌÆ®žŠ Œ±ŸðÇÏ°í °ªÀº 0x55
db 0xAA             ; 1¹ÙÀÌÆ®žŠ Œ±ŸðÇÏ°í °ªÀº 0xAA
                    ; Ÿîµå·¹œº 511, 512¿¡ 0x55, 0xAAžŠ œáŒ­ ºÎÆ® ŒœÅÍ·Î Ç¥±âÇÔ